#### Terraform Format, Workspace and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/ekipDevops/CarRental-prod/runs/run-AEMEoR2j25GnVMHw

Waiting for the plan to start...

Terraform v1.3.8
on linux_amd64
Initializing plugins and modules...
data.aws_availability_zones.available: Reading...
aws_vpc.CarPlatform-vpc: Refreshing state... [id=vpc-027b374c6698bd9fc]
data.aws_availability_zones.available: Read complete after 1s [id=eu-west-1]
aws_subnet.public_subnet[1]: Refreshing state... [id=subnet-014c4a1da95f25139]
aws_subnet.public_subnet[0]: Refreshing state... [id=subnet-04adcb9005012540d]
aws_subnet.private_subnet[0]: Refreshing state... [id=subnet-05a9e67700564f2dc]
aws_subnet.private_subnet[1]: Refreshing state... [id=subnet-0e41285a7c7696a6b]
aws_subnet.public_subnet[2]: Refreshing state... [id=subnet-02a9b1ab71a18c5a0]
aws_subnet.private_subnet[2]: Refreshing state... [id=subnet-0ebc84c5249a209d3]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_default_route_table.main-private will be created
  + resource "aws_default_route_table" "main-private" {
      + arn                    = (known after apply)
      + default_route_table_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + route                  = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + instance_id                = (known after apply)
              + ipv6_cidr_block            = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags                   = {
          + "Name"    = "CarRental-prod-RT-Private"
          + "Project" = "CarPlatform"
        }
      + tags_all               = {
          + "Name"    = "CarRental-prod-RT-Private"
          + "Project" = "CarPlatform"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_instance.nat will be created
  + resource "aws_instance" "nat" {
      + ami                                  = "ami-0b752bf1df193a6c4"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = false
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name"    = "CarRental-prod-NAT"
          + "Project" = "CarPlatform"
        }
      + tags_all                             = {
          + "Name"    = "CarRental-prod-NAT"
          + "Project" = "CarPlatform"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "542e0bf338dc923976682333ff10ea07b0db9bd1"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + maintenance_options {
          + auto_recovery = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + private_dns_name_options {
          + enable_resource_name_dns_a_record    = (known after apply)
          + enable_resource_name_dns_aaaa_record = (known after apply)
          + hostname_type                        = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_internet_gateway.igw will be created
  + resource "aws_internet_gateway" "igw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name"    = "CarRental-prod-igw"
          + "Project" = "CarPlatform"
        }
      + tags_all = {
          + "Name"    = "CarRental-prod-igw"
          + "Project" = "CarPlatform"
        }
      + vpc_id   = (known after apply)
    }

  # aws_route_table.public will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = (known after apply)
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Name"    = "CarRental-prod-RT-Public"
          + "Project" = "CarPlatform"
        }
      + tags_all         = {
          + "Name"    = "CarRental-prod-RT-Public"
          + "Project" = "CarPlatform"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private[2] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public[2] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_security_group.allow_nat will be created
  + resource "aws_security_group" "allow_nat" {
      + arn                    = (known after apply)
      + description            = "Allow inbound traffic"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "allow_web"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = (known after apply)
    }

  # aws_security_group_rule.allow_nat[0] will be created
  + resource "aws_security_group_rule" "allow_nat" {
      + cidr_blocks              = [
          + "10.0.20.0/24",
        ]
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "ingress"
    }

  # aws_security_group_rule.allow_nat[1] will be created
  + resource "aws_security_group_rule" "allow_nat" {
      + cidr_blocks              = [
          + "10.0.21.0/24",
        ]
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "ingress"
    }

  # aws_security_group_rule.allow_nat[2] will be created
  + resource "aws_security_group_rule" "allow_nat" {
      + cidr_blocks              = [
          + "10.0.22.0/24",
        ]
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "ingress"
    }

  # aws_security_group_rule.egress_nat will be created
  + resource "aws_security_group_rule" "egress_nat" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # aws_subnet.private_subnet[0] must be replaced
-/+ resource "aws_subnet" "private_subnet" {
      ~ arn                                            = "arn:aws:ec2:eu-west-1:560022977783:subnet/subnet-05a9e67700564f2dc" -> (known after apply)
      ~ availability_zone_id                           = "euw1-az2" -> (known after apply)
      ~ id                                             = "subnet-05a9e67700564f2dc" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "560022977783" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
      ~ tags                                           = {
          + "Project" = "CarPlatform"
            # (1 unchanged element hidden)
        }
      ~ tags_all                                       = {
          + "Project" = "CarPlatform"
            # (1 unchanged element hidden)
        }
      ~ vpc_id                                         = "vpc-027b374c6698bd9fc" -> (known after apply) # forces replacement
        # (8 unchanged attributes hidden)
    }

  # aws_subnet.private_subnet[1] must be replaced
-/+ resource "aws_subnet" "private_subnet" {
      ~ arn                                            = "arn:aws:ec2:eu-west-1:560022977783:subnet/subnet-0e41285a7c7696a6b" -> (known after apply)
      ~ availability_zone_id                           = "euw1-az3" -> (known after apply)
      ~ id                                             = "subnet-0e41285a7c7696a6b" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "560022977783" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
      ~ tags                                           = {
          + "Project" = "CarPlatform"
            # (1 unchanged element hidden)
        }
      ~ tags_all                                       = {
          + "Project" = "CarPlatform"
            # (1 unchanged element hidden)
        }
      ~ vpc_id                                         = "vpc-027b374c6698bd9fc" -> (known after apply) # forces replacement
        # (8 unchanged attributes hidden)
    }

  # aws_subnet.private_subnet[2] must be replaced
-/+ resource "aws_subnet" "private_subnet" {
      ~ arn                                            = "arn:aws:ec2:eu-west-1:560022977783:subnet/subnet-0ebc84c5249a209d3" -> (known after apply)
      ~ availability_zone_id                           = "euw1-az1" -> (known after apply)
      ~ id                                             = "subnet-0ebc84c5249a209d3" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "560022977783" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
      ~ tags                                           = {
          + "Project" = "CarPlatform"
            # (1 unchanged element hidden)
        }
      ~ tags_all                                       = {
          + "Project" = "CarPlatform"
            # (1 unchanged element hidden)
        }
      ~ vpc_id                                         = "vpc-027b374c6698bd9fc" -> (known after apply) # forces replacement
        # (8 unchanged attributes hidden)
    }

  # aws_subnet.public_subnet[0] must be replaced
-/+ resource "aws_subnet" "public_subnet" {
      ~ arn                                            = "arn:aws:ec2:eu-west-1:560022977783:subnet/subnet-04adcb9005012540d" -> (known after apply)
      ~ availability_zone_id                           = "euw1-az2" -> (known after apply)
      ~ id                                             = "subnet-04adcb9005012540d" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "560022977783" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
      ~ tags                                           = {
          + "Project" = "CarPlatform"
            # (1 unchanged element hidden)
        }
      ~ tags_all                                       = {
          + "Project" = "CarPlatform"
            # (1 unchanged element hidden)
        }
      ~ vpc_id                                         = "vpc-027b374c6698bd9fc" -> (known after apply) # forces replacement
        # (8 unchanged attributes hidden)
    }

  # aws_subnet.public_subnet[1] must be replaced
-/+ resource "aws_subnet" "public_subnet" {
      ~ arn                                            = "arn:aws:ec2:eu-west-1:560022977783:subnet/subnet-014c4a1da95f25139" -> (known after apply)
      ~ availability_zone_id                           = "euw1-az3" -> (known after apply)
      ~ id                                             = "subnet-014c4a1da95f25139" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "560022977783" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
      ~ tags                                           = {
          + "Project" = "CarPlatform"
            # (1 unchanged element hidden)
        }
      ~ tags_all                                       = {
          + "Project" = "CarPlatform"
            # (1 unchanged element hidden)
        }
      ~ vpc_id                                         = "vpc-027b374c6698bd9fc" -> (known after apply) # forces replacement
        # (8 unchanged attributes hidden)
    }

  # aws_subnet.public_subnet[2] must be replaced
-/+ resource "aws_subnet" "public_subnet" {
      ~ arn                                            = "arn:aws:ec2:eu-west-1:560022977783:subnet/subnet-02a9b1ab71a18c5a0" -> (known after apply)
      ~ availability_zone_id                           = "euw1-az1" -> (known after apply)
      ~ id                                             = "subnet-02a9b1ab71a18c5a0" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "560022977783" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
      ~ tags                                           = {
          + "Project" = "CarPlatform"
            # (1 unchanged element hidden)
        }
      ~ tags_all                                       = {
          + "Project" = "CarPlatform"
            # (1 unchanged element hidden)
        }
      ~ vpc_id                                         = "vpc-027b374c6698bd9fc" -> (known after apply) # forces replacement
        # (8 unchanged attributes hidden)
    }

  # aws_vpc.CarPlatform-vpc will be destroyed
  # (because aws_vpc.CarPlatform-vpc is not in configuration)
  - resource "aws_vpc" "CarPlatform-vpc" {
      - arn                                  = "arn:aws:ec2:eu-west-1:560022977783:vpc/vpc-027b374c6698bd9fc" -> null
      - assign_generated_ipv6_cidr_block     = false -> null
      - cidr_block                           = "10.0.0.0/16" -> null
      - default_network_acl_id               = "acl-004a0db1474bded0d" -> null
      - default_route_table_id               = "rtb-0d33243e334de1646" -> null
      - default_security_group_id            = "sg-05a7909c5c46e86ac" -> null
      - dhcp_options_id                      = "dopt-0f62b547f91af136b" -> null
      - enable_classiclink                   = false -> null
      - enable_classiclink_dns_support       = false -> null
      - enable_dns_hostnames                 = true -> null
      - enable_dns_support                   = true -> null
      - enable_network_address_usage_metrics = false -> null
      - id                                   = "vpc-027b374c6698bd9fc" -> null
      - instance_tenancy                     = "default" -> null
      - ipv6_netmask_length                  = 0 -> null
      - main_route_table_id                  = "rtb-0d33243e334de1646" -> null
      - owner_id                             = "560022977783" -> null
      - tags                                 = {
          - "Name" = "CarRental-prod-VPC"
        } -> null
      - tags_all                             = {
          - "Name" = "CarRental-prod-VPC"
        } -> null
    }

  # aws_vpc.vpc will be created
  + resource "aws_vpc" "vpc" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name"    = "CarRental-prod-VPC"
          + "Project" = "CarPlatform"
        }
      + tags_all                             = {
          + "Name"    = "CarRental-prod-VPC"
          + "Project" = "CarPlatform"
        }
    }

Plan: 22 to add, 0 to change, 7 to destroy.


```

</details>

*Pushed by: @T-jegou, Action: `pull_request`*